---------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jules/Downloads/ps4/output/ps4.log
  log type:  text
 opened on:   2 Dec 2024, 17:17:44

. 
. *Q3: loading dataset
. use "rawdata/irssoi_cz.dta", replace

. 
. *Q4: collapsing data so that it contains means of the variable cg_per_return by year, bin, and incomebin.
. 
. collapse (mean) cg_per_return [aw=returns], by(year bin incomebin)

. 
. save "output/collapsed", replace
file output/collapsed.dta saved

. 
. *Q5: adding another variable to our dataset using frame and tax dataset
. frame create taxrate

. frame taxrate: use "rawdata/taxrates_wide.dta", replace
(Data contains capital gains tax rates for high income AGI bins)

. frame change taxrate

. 
. reshape long cg_rate, i(bin) j(year)
(j = 2009 2010 2011 2012 2013 2014 2015)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations                2   ->   14          
Number of variables                   8   ->   3           
j variable (7 values)                     ->   year
xij variables:
cg_rate2009 cg_rate2010 ... cg_rate2015   ->   cg_rate
-----------------------------------------------------------------------------

. 
. *Q6 merging the dataset
. merge 1:m year bin using "output/collapsed"

    Result                      Number of obs
    -----------------------------------------
    Not matched                            35
        from master                         0  (_merge==1)
        from using                         35  (_merge==2)

    Matched                                14  (_merge==3)
    -----------------------------------------

. 
. /*
> 14 observations were successfully matched from both datasets. From the taxrate datasets, all observations were matched. In the IRS da
> taset, 35 obsevations didn't get matched because the observations are 
> from non control or treatment bin group. There are 35 unique observations in IRS data and 0 unique observations in Tax rate data set.
> 
> */
. 
. *Q7: Panel A plot 
. label variable cg_rate "Capital Gains Tax Rate (%)"

. label variable year "Year"

. 
. graph twoway (scatter cg_rate year if incomebin == 6, msymbol(T) connect(L) mcolor(black)) ///
> (scatter cg_rate year if incomebin == 7,  msymbol(S) connect(L) mcolor(red)  lpattern(dash) lcolor(red)) ///
> , ylabel(0(5)25) xlabel(2009(1)2015) xline(2012.5, lwidth(thin) lpattern(solid) lcolor(red)) ///
> title("(a) Top capital gains tax rate by size of AGI") ///
> legend(rows(1) label(1 "[$100K,$200K] (control)") label(2 "> $200K (treatment)") position(6))

. graph export "output/figure1.png",replace
file /Users/jules/Downloads/ps4/output/figure1.png saved as PNG format

. 
. 
. *Q8: Panel B Plot
. 
. graph twoway (scatter cg_per_return year if incomebin == 6, c(l)  msymbol(T) mcolor(black)) (scatter cg_per_return year if incomebin 
> == 7, c(l)  mcolor(red)  lpattern(dash) lcolor(red) yaxis(2)),ylabel(1.5(0.5)3.5) ylabel(50(10)90, axis(2))  ytitle("Control Group ($
> 1000s)") ytitle("Treatment Group($1000s)", axis(2))  xlabel(2009(1)2015) title("(b) Realized capital gains by size of AGI") xline(201
> 2.5, lwidth(thin) lpattern(solid) lcolor(red))  legend(rows(1) label(1 "[$100K,$200K] (control)") label(2 "> $200K (treatment)") posi
> tion(6))

. graph export "output/figure2.png", replace
file /Users/jules/Downloads/ps4/output/figure2.png saved as PNG format

. 
. *Q9: regression table
. 
. frame change default

. frame default: use "rawdata/irssoi_cz.dta", replace

. 
. 
. gen treat = 0 if incomebin == 6
(30,702 missing values generated)

. replace treat = 1 if incomebin == 7
(5,117 real changes made)

. 
. gen post = 0 if year < 2013
(15,351 missing values generated)

. replace post = 1 if year >= 2013
(15,351 real changes made)

. 
. reg cg_per_return treat post i.post##i.treat, r
note: 1.post omitted because of collinearity.
note: 1.treat omitted because of collinearity.

Linear regression                               Number of obs     =      9,978
                                                F(3, 9974)        =    1429.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2996
                                                Root MSE          =       32.1

------------------------------------------------------------------------------
             |               Robust
cg_per_ret~n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       treat |   43.58386   .9672798    45.06   0.000     41.68779    45.47992
        post |   .5545654   .1573465     3.52   0.000     .2461345    .8629964
      1.post |          0  (omitted)
     1.treat |          0  (omitted)
             |
  post#treat |
        1 1  |  -3.833314   1.280287    -2.99   0.003    -6.342936   -1.323693
             |
       _cons |   4.575142   .1178334    38.83   0.000     4.344165     4.80612
------------------------------------------------------------------------------

. outreg2 using "output/table1.doc", replace keep(treat post 1.post##1.treat)
output/table1.doc
dir : seeout

. 
. *Q10: figure and table interpretation
. /*
> In the first figure the tax between two groups before 2013 is relatively the same. However with the increase 17% capital gains for ho
> usehold with adjusted gross income(AGI) of above $200k the, the treatment group gains increases more, differing from the control grou
> p of households with AGI between $100k and $200K. 
> 
> In the second figure we see that realized gains for treatment group AGI above $200k had higher than those in control group before the
>  capitalized gains tax was raised, but after this increase the it reversed.
> 
> Table interpretation: the regression shows a statistically significant negative coefficient on the interaction term, supporting the h
> ypothesis that higher capital gains tax rates reduce capital gains realizations among high-income taxpayers.
> 
> The equation to estimate diff-in-diff looks fine to me but if I was to modify something, I would include other control variables to c
> apture other confounding factors like household characteristics, etc
> */
. 
. 
. 
. 
end of do-file

. help estat

. do "/var/folders/7s/2jdh2p195rl16_3vrqh5qn7r0000gn/T//SD20443.000000"

. 
. estat trendplots
estat trendplots not valid
r(321);

end of do-file

r(321);

. do "/var/folders/7s/2jdh2p195rl16_3vrqh5qn7r0000gn/T//SD20443.000000"

. * Jules Niyitegeka
. * PSET3
. * Econ 970
. version 18

. 
. clear all

. 
. capture log close
